Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PERIPHERAL                    LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_SIGNAL                             TX   /*!< LPUART1 signal: TX */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PIN_NAME                GPIO_AD_B0_12   /*!< Pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_LABEL                     "UART1_TXD"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_NAME                      "UART1_TXD"   /*!< Identifier name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PERIPHERAL                    LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_SIGNAL                             RX   /*!< LPUART1 signal: RX */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PIN_NAME                GPIO_AD_B0_13   /*!< Pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_LABEL                     "UART1_RXD"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_NAME                      "UART1_RXD"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
#define BOARD_INITSDRAMPINS_SEMC_A0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A0_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A0_CHANNEL                                   0U   /*!< SEMC ADDR channel: 00 */
#define BOARD_INITSDRAMPINS_SEMC_A0_PIN_NAME                         GPIO_EMC_09   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A0_LABEL                              "SEMC_A0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A0_NAME                               "SEMC_A0"   /*!< Identifier name */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
#define BOARD_INITSDRAMPINS_SEMC_A1_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A1_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A1_CHANNEL                                   1U   /*!< SEMC ADDR channel: 01 */
#define BOARD_INITSDRAMPINS_SEMC_A1_PIN_NAME                         GPIO_EMC_10   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A1_LABEL                              "SEMC_A1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A1_NAME                               "SEMC_A1"   /*!< Identifier name */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
#define BOARD_INITSDRAMPINS_SEMC_A2_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A2_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A2_CHANNEL                                   2U   /*!< SEMC ADDR channel: 02 */
#define BOARD_INITSDRAMPINS_SEMC_A2_PIN_NAME                         GPIO_EMC_11   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A2_LABEL                              "SEMC_A2"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A2_NAME                               "SEMC_A2"   /*!< Identifier name */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
#define BOARD_INITSDRAMPINS_SEMC_A3_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A3_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A3_CHANNEL                                   3U   /*!< SEMC ADDR channel: 03 */
#define BOARD_INITSDRAMPINS_SEMC_A3_PIN_NAME                         GPIO_EMC_12   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A3_LABEL                              "SEMC_A3"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A3_NAME                               "SEMC_A3"   /*!< Identifier name */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
#define BOARD_INITSDRAMPINS_SEMC_A4_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A4_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A4_CHANNEL                                   4U   /*!< SEMC ADDR channel: 04 */
#define BOARD_INITSDRAMPINS_SEMC_A4_PIN_NAME                         GPIO_EMC_13   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A4_LABEL                              "SEMC_A4"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A4_NAME                               "SEMC_A4"   /*!< Identifier name */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
#define BOARD_INITSDRAMPINS_SEMC_A5_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A5_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A5_CHANNEL                                   5U   /*!< SEMC ADDR channel: 05 */
#define BOARD_INITSDRAMPINS_SEMC_A5_PIN_NAME                         GPIO_EMC_14   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A5_LABEL                              "SEMC_A5"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A5_NAME                               "SEMC_A5"   /*!< Identifier name */

