Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/* GPIO_EMC_34 (coord D4), SEMC_D12 */
#define BOARD_INITSDRAMPINS_SEMC_D12_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D12_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D12_CHANNEL                                 12U   /*!< SEMC DATA channel: 12 */
#define BOARD_INITSDRAMPINS_SEMC_D12_PIN_NAME                        GPIO_EMC_34   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D12_LABEL                            "SEMC_D12"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D12_NAME                             "SEMC_D12"   /*!< Identifier name */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
#define BOARD_INITSDRAMPINS_SEMC_D13_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D13_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D13_CHANNEL                                 13U   /*!< SEMC DATA channel: 13 */
#define BOARD_INITSDRAMPINS_SEMC_D13_PIN_NAME                        GPIO_EMC_35   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D13_LABEL                            "SEMC_D13"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D13_NAME                             "SEMC_D13"   /*!< Identifier name */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
#define BOARD_INITSDRAMPINS_SEMC_D14_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D14_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D14_CHANNEL                                 14U   /*!< SEMC DATA channel: 14 */
#define BOARD_INITSDRAMPINS_SEMC_D14_PIN_NAME                        GPIO_EMC_36   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D14_LABEL                            "SEMC_D14"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D14_NAME                             "SEMC_D14"   /*!< Identifier name */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
#define BOARD_INITSDRAMPINS_SEMC_D15_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D15_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D15_CHANNEL                                 15U   /*!< SEMC DATA channel: 15 */
#define BOARD_INITSDRAMPINS_SEMC_D15_PIN_NAME                        GPIO_EMC_37   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D15_LABEL                            "SEMC_D15"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D15_NAME                             "SEMC_D15"   /*!< Identifier name */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_DM0_SIGNAL                                   DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAMPINS_SEMC_DM0_CHANNEL                                  0U   /*!< SEMC DM channel: 0 */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PIN_NAME                        GPIO_EMC_08   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_LABEL                            "SEMC_DM0"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM0_NAME                             "SEMC_DM0"   /*!< Identifier name */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_DM1_SIGNAL                                   DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAMPINS_SEMC_DM1_CHANNEL                                  1U   /*!< SEMC DM channel: 1 */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PIN_NAME                        GPIO_EMC_38   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_LABEL                            "SEMC_DM1"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM1_NAME                             "SEMC_DM1"   /*!< Identifier name */

/* GPIO_EMC_25 (coord D2), SEMC_RAS */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_RAS_SIGNAL                             semc_ras   /*!< SEMC signal: semc_ras */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PIN_NAME                        GPIO_EMC_25   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_LABEL                            "SEMC_RAS"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_RAS_NAME                             "SEMC_RAS"   /*!< Identifier name */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
#define BOARD_INITSDRAMPINS_SEMC_WE_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_WE_SIGNAL                               semc_we   /*!< SEMC signal: semc_we */
#define BOARD_INITSDRAMPINS_SEMC_WE_PIN_NAME                         GPIO_EMC_28   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_WE_LABEL                              "SEMC_WE"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_WE_NAME                               "SEMC_WE"   /*!< Identifier name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
#define BOARD_INITSDRAMPINS_ENET_MDIO_PERIPHERAL                            SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_ENET_MDIO_SIGNAL                                 CSX   /*!< SEMC signal: CSX */
#define BOARD_INITSDRAMPINS_ENET_MDIO_CHANNEL                                 0U   /*!< SEMC CSX channel: 0 */
#define BOARD_INITSDRAMPINS_ENET_MDIO_PIN_NAME                       GPIO_EMC_41   /*!< Pin name */
#define BOARD_INITSDRAMPINS_ENET_MDIO_LABEL                          "ENET_MDIO"   /*!< Label */
#define BOARD_INITSDRAMPINS_ENET_MDIO_NAME                           "ENET_MDIO"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

