Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
#define BOARD_INITCSIPINS_CSI_D9_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D9_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D9_CHANNEL                                      9U   /*!< CSI csi_data channel: 09 */
#define BOARD_INITCSIPINS_CSI_D9_PIN_NAME                          GPIO_AD_B1_08   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D9_LABEL          "AUD_INT/CSI_D9//J35[13]/J22[4]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D9_NAME                                   "CSI_D9"   /*!< Identifier name */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11] */
#define BOARD_INITCSIPINS_CSI_D8_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D8_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D8_CHANNEL                                      8U   /*!< CSI csi_data channel: 08 */
#define BOARD_INITCSIPINS_CSI_D8_PIN_NAME                          GPIO_AD_B1_09   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D8_LABEL                "SAI1_MCLK/CSI_D8/J35[11]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D8_NAME                                   "CSI_D8"   /*!< Identifier name */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1] */
#define BOARD_INITCSIPINS_CSI_D7_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D7_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D7_CHANNEL                                      7U   /*!< CSI csi_data channel: 07 */
#define BOARD_INITCSIPINS_CSI_D7_PIN_NAME                          GPIO_AD_B1_10   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D7_LABEL       "SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D7_NAME                                   "CSI_D7"   /*!< Identifier name */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
#define BOARD_INITCSIPINS_CSI_D6_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D6_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D6_CHANNEL                                      6U   /*!< CSI csi_data channel: 06 */
#define BOARD_INITCSIPINS_CSI_D6_PIN_NAME                          GPIO_AD_B1_11   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D6_LABEL       "SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D6_NAME                                   "CSI_D6"   /*!< Identifier name */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
#define BOARD_INITCSIPINS_CSI_D5_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D5_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D5_CHANNEL                                      5U   /*!< CSI csi_data channel: 05 */
#define BOARD_INITCSIPINS_CSI_D5_PIN_NAME                          GPIO_AD_B1_12   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D5_LABEL          "SAI1_RXD/CSI_D5/J35[5]/U13[16]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D5_NAME                                   "CSI_D5"   /*!< Identifier name */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
#define BOARD_INITCSIPINS_CSI_D4_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D4_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D4_CHANNEL                                      4U   /*!< CSI csi_data channel: 04 */
#define BOARD_INITCSIPINS_CSI_D4_PIN_NAME                          GPIO_AD_B1_13   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D4_LABEL          "SAI1_TXD/CSI_D4/J35[3]/U13[14]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D4_NAME                                   "CSI_D4"   /*!< Identifier name */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
#define BOARD_INITCSIPINS_CSI_D2_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D2_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D2_CHANNEL                                      2U   /*!< CSI csi_data channel: 02 */
#define BOARD_INITCSIPINS_CSI_D2_PIN_NAME                          GPIO_AD_B1_15   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D2_LABEL      "SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D2_NAME                                   "CSI_D2"   /*!< Identifier name */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
#define BOARD_INITCSIPINS_CSI_D3_PERIPHERAL                                  CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_D3_SIGNAL                                 csi_data   /*!< CSI signal: csi_data */
#define BOARD_INITCSIPINS_CSI_D3_CHANNEL                                      3U   /*!< CSI csi_data channel: 03 */
#define BOARD_INITCSIPINS_CSI_D3_PIN_NAME                          GPIO_AD_B1_14   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_D3_LABEL      "SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_D3_NAME                                   "CSI_D3"   /*!< Identifier name */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J35[8]/J23[3] */
#define BOARD_INITCSIPINS_CSI_PIXCLK_PERIPHERAL                              CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_PIXCLK_SIGNAL                           csi_pixclk   /*!< CSI signal: csi_pixclk */
#define BOARD_INITCSIPINS_CSI_PIXCLK_PIN_NAME                      GPIO_AD_B1_04   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_PIXCLK_LABEL            "CSI_PIXCLK/J35[8]/J23[3]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_PIXCLK_NAME                           "CSI_PIXCLK"   /*!< Identifier name */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J35[12]/J23[4] */
#define BOARD_INITCSIPINS_CSI_MCLK_PERIPHERAL                                CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_MCLK_SIGNAL                               csi_mclk   /*!< CSI signal: csi_mclk */
#define BOARD_INITCSIPINS_CSI_MCLK_PIN_NAME                        GPIO_AD_B1_05   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_MCLK_LABEL               "CSI_MCLK/J35[12]/J23[4]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_MCLK_NAME                               "CSI_MCLK"   /*!< Identifier name */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
#define BOARD_INITCSIPINS_CSI_VSYNC_PERIPHERAL                               CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_VSYNC_SIGNAL                             csi_vsync   /*!< CSI signal: csi_vsync */
#define BOARD_INITCSIPINS_CSI_VSYNC_PIN_NAME                       GPIO_AD_B1_06   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_VSYNC_LABEL     "CSI_VSYNC/J35[18]/J22[2]/UART_TX"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_VSYNC_NAME                             "CSI_VSYNC"   /*!< Identifier name */

