Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
#define BOARD_INITCSIPINS_CSI_HSYNC_PERIPHERAL                               CSI   /*!< Device name: CSI */
#define BOARD_INITCSIPINS_CSI_HSYNC_SIGNAL                             csi_hsync   /*!< CSI signal: csi_hsync */
#define BOARD_INITCSIPINS_CSI_HSYNC_PIN_NAME                       GPIO_AD_B1_07   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_HSYNC_LABEL     "CSI_HSYNC/J35[16]/J22[1]/UART_RX"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_HSYNC_NAME                             "CSI_HSYNC"   /*!< Identifier name */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_PERIPHERAL                          LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_SIGNAL                                 SCL   /*!< LPI2C1 signal: SCL */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_PIN_NAME                     GPIO_AD_B1_00   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_LABEL "I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4]" /*!< Label */
#define BOARD_INITCSIPINS_CSI_I2C_SCL_NAME                         "CSI_I2C_SCL"   /*!< Identifier name */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6] */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_PERIPHERAL                          LPI2C1   /*!< Device name: LPI2C1 */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_SIGNAL                                 SDA   /*!< LPI2C1 signal: SDA */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_PIN_NAME                     GPIO_AD_B1_01   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_LABEL "I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6]" /*!< Label */
#define BOARD_INITCSIPINS_CSI_I2C_SDA_NAME                         "CSI_I2C_SDA"   /*!< Identifier name */

/* GPIO_AD_B0_04 (coord F11), CSI_PWDN/J35[17]/BOOT_MODE[0] */
#define BOARD_INITCSIPINS_CSI_PWDN_GPIO                                    GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITCSIPINS_CSI_PWDN_PORT                                    GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITCSIPINS_CSI_PWDN_GPIO_PIN                                   4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITCSIPINS_CSI_PWDN_PIN_NAME                        GPIO_AD_B0_04   /*!< Pin name */
#define BOARD_INITCSIPINS_CSI_PWDN_LABEL         "CSI_PWDN/J35[17]/BOOT_MODE[0]"   /*!< Label */
#define BOARD_INITCSIPINS_CSI_PWDN_NAME                               "CSI_PWDN"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCSIPins(void);

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
#define BOARD_INITLCDPINS_LCDIF_D0_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D0_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D0_CHANNEL                                    0U   /*!< LCDIF lcdif_data channel: 00 */
#define BOARD_INITLCDPINS_LCDIF_D0_PIN_NAME                           GPIO_B0_04   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D0_LABEL                    "LCDIF_D0/BT_CFG[0]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D0_NAME                               "LCDIF_D0"   /*!< Identifier name */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
#define BOARD_INITLCDPINS_LCDIF_D1_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D1_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D1_CHANNEL                                    1U   /*!< LCDIF lcdif_data channel: 01 */
#define BOARD_INITLCDPINS_LCDIF_D1_PIN_NAME                           GPIO_B0_05   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D1_LABEL                    "LCDIF_D1/BT_CFG[1]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D1_NAME                               "LCDIF_D1"   /*!< Identifier name */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
#define BOARD_INITLCDPINS_LCDIF_D2_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D2_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D2_CHANNEL                                    2U   /*!< LCDIF lcdif_data channel: 02 */
#define BOARD_INITLCDPINS_LCDIF_D2_PIN_NAME                           GPIO_B0_06   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D2_LABEL                    "LCDIF_D2/BT_CFG[2]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D2_NAME                               "LCDIF_D2"   /*!< Identifier name */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
#define BOARD_INITLCDPINS_LCDIF_CLK_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_CLK_SIGNAL                             lcdif_clk   /*!< LCDIF signal: lcdif_clk */
#define BOARD_INITLCDPINS_LCDIF_CLK_PIN_NAME                          GPIO_B0_00   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_CLK_LABEL                            "LCDIF_CLK"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_CLK_NAME                             "LCDIF_CLK"   /*!< Identifier name */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
#define BOARD_INITLCDPINS_LCDIF_D3_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D3_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D3_CHANNEL                                    3U   /*!< LCDIF lcdif_data channel: 03 */
#define BOARD_INITLCDPINS_LCDIF_D3_PIN_NAME                           GPIO_B0_07   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D3_LABEL                    "LCDIF_D3/BT_CFG[3]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D3_NAME                               "LCDIF_D3"   /*!< Identifier name */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
#define BOARD_INITLCDPINS_LCDIF_D4_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D4_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D4_CHANNEL                                    4U   /*!< LCDIF lcdif_data channel: 04 */
#define BOARD_INITLCDPINS_LCDIF_D4_PIN_NAME                           GPIO_B0_08   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D4_LABEL                    "LCDIF_D4/BT_CFG[4]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D4_NAME                               "LCDIF_D4"   /*!< Identifier name */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
#define BOARD_INITLCDPINS_LCDIF_D5_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D5_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D5_CHANNEL                                    5U   /*!< LCDIF lcdif_data channel: 05 */
#define BOARD_INITLCDPINS_LCDIF_D5_PIN_NAME                           GPIO_B0_09   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D5_LABEL                    "LCDIF_D5/BT_CFG[5]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D5_NAME                               "LCDIF_D5"   /*!< Identifier name */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
#define BOARD_INITLCDPINS_LCDIF_D6_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D6_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D6_CHANNEL                                    6U   /*!< LCDIF lcdif_data channel: 06 */
#define BOARD_INITLCDPINS_LCDIF_D6_PIN_NAME                           GPIO_B0_10   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D6_LABEL                    "LCDIF_D6/BT_CFG[6]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D6_NAME                               "LCDIF_D6"   /*!< Identifier name */

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
#define BOARD_INITLCDPINS_LCDIF_D7_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D7_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D7_CHANNEL                                    7U   /*!< LCDIF lcdif_data channel: 07 */
#define BOARD_INITLCDPINS_LCDIF_D7_PIN_NAME                           GPIO_B0_11   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D7_LABEL                    "LCDIF_D7/BT_CFG[7]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D7_NAME                               "LCDIF_D7"   /*!< Identifier name */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
#define BOARD_INITLCDPINS_LCDIF_D8_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D8_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D8_CHANNEL                                    8U   /*!< LCDIF lcdif_data channel: 08 */
#define BOARD_INITLCDPINS_LCDIF_D8_PIN_NAME                           GPIO_B0_12   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D8_LABEL                    "LCDIF_D8/BT_CFG[8]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D8_NAME                               "LCDIF_D8"   /*!< Identifier name */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
#define BOARD_INITLCDPINS_LCDIF_D9_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D9_SIGNAL                             lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D9_CHANNEL                                    9U   /*!< LCDIF lcdif_data channel: 09 */
#define BOARD_INITLCDPINS_LCDIF_D9_PIN_NAME                           GPIO_B0_13   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D9_LABEL                    "LCDIF_D9/BT_CFG[9]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D9_NAME                               "LCDIF_D9"   /*!< Identifier name */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
#define BOARD_INITLCDPINS_LCDIF_D10_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D10_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D10_CHANNEL                                  10U   /*!< LCDIF lcdif_data channel: 10 */
#define BOARD_INITLCDPINS_LCDIF_D10_PIN_NAME                          GPIO_B0_14   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D10_LABEL                 "LCDIF_D10/BT_CFG[10]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D10_NAME                             "LCDIF_D10"   /*!< Identifier name */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
#define BOARD_INITLCDPINS_LCDIF_D11_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D11_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D11_CHANNEL                                  11U   /*!< LCDIF lcdif_data channel: 11 */
#define BOARD_INITLCDPINS_LCDIF_D11_PIN_NAME                          GPIO_B0_15   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D11_LABEL                 "LCDIF_D11/BT_CFG[11]"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D11_NAME                             "LCDIF_D11"   /*!< Identifier name */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
#define BOARD_INITLCDPINS_LCDIF_D12_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D12_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D12_CHANNEL                                  12U   /*!< LCDIF lcdif_data channel: 12 */
#define BOARD_INITLCDPINS_LCDIF_D12_PIN_NAME                          GPIO_B1_00   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D12_LABEL                            "LCDIF_D12"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D12_NAME                             "LCDIF_D12"   /*!< Identifier name */

