Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
#define BOARD_INITLCDPINS_LCDIF_D13_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D13_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D13_CHANNEL                                  13U   /*!< LCDIF lcdif_data channel: 13 */
#define BOARD_INITLCDPINS_LCDIF_D13_PIN_NAME                          GPIO_B1_01   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D13_LABEL                            "LCDIF_D13"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D13_NAME                             "LCDIF_D13"   /*!< Identifier name */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
#define BOARD_INITLCDPINS_LCDIF_D14_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D14_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D14_CHANNEL                                  14U   /*!< LCDIF lcdif_data channel: 14 */
#define BOARD_INITLCDPINS_LCDIF_D14_PIN_NAME                          GPIO_B1_02   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D14_LABEL                            "LCDIF_D14"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D14_NAME                             "LCDIF_D14"   /*!< Identifier name */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
#define BOARD_INITLCDPINS_LCDIF_D15_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_D15_SIGNAL                            lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITLCDPINS_LCDIF_D15_CHANNEL                                  15U   /*!< LCDIF lcdif_data channel: 15 */
#define BOARD_INITLCDPINS_LCDIF_D15_PIN_NAME                          GPIO_B1_03   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_D15_LABEL                            "LCDIF_D15"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_D15_NAME                             "LCDIF_D15"   /*!< Identifier name */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PERIPHERAL                          LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_SIGNAL                       lcdif_enable   /*!< LCDIF signal: lcdif_enable */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_PIN_NAME                       GPIO_B0_01   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_LABEL                      "LCDIF_ENABLE"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_ENABLE_NAME                       "LCDIF_ENABLE"   /*!< Identifier name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PERIPHERAL                           LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_SIGNAL                         lcdif_hsync   /*!< LCDIF signal: lcdif_hsync */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_PIN_NAME                        GPIO_B0_02   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_LABEL                        "LCDIF_HSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_HSYNC_NAME                         "LCDIF_HSYNC"   /*!< Identifier name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PERIPHERAL                           LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_SIGNAL                         lcdif_vsync   /*!< LCDIF signal: lcdif_vsync */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_PIN_NAME                        GPIO_B0_03   /*!< Pin name */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_LABEL                        "LCDIF_VSYNC"   /*!< Label */
#define BOARD_INITLCDPINS_LCDIF_VSYNC_NAME                         "LCDIF_VSYNC"   /*!< Identifier name */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_GPIO                               GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PORT                               GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_GPIO_PIN                             31U   /*!< GPIO2 pin index: 31 */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_PIN_NAME                      GPIO_B1_15   /*!< Pin name */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_LABEL       "USB_HOST_PWR/BACKLIGHT_CTL"   /*!< Label */
#define BOARD_INITLCDPINS_BACKLIGHT_CTL_NAME                     "BACKLIGHT_CTL"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
#define BOARD_INITCANPINS_CAN2_TX_PERIPHERAL                                CAN2   /*!< Device name: CAN2 */
#define BOARD_INITCANPINS_CAN2_TX_SIGNAL                                      TX   /*!< CAN2 signal: TX */
#define BOARD_INITCANPINS_CAN2_TX_PIN_NAME                         GPIO_AD_B0_14   /*!< Pin name */
#define BOARD_INITCANPINS_CAN2_TX_LABEL                         "CAN2_TX/U12[1]"   /*!< Label */
#define BOARD_INITCANPINS_CAN2_TX_NAME                                 "CAN2_TX"   /*!< Identifier name */

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4] */
#define BOARD_INITCANPINS_CAN2_RX_PERIPHERAL                                CAN2   /*!< Device name: CAN2 */
#define BOARD_INITCANPINS_CAN2_RX_SIGNAL                                      RX   /*!< CAN2 signal: RX */
#define BOARD_INITCANPINS_CAN2_RX_PIN_NAME                         GPIO_AD_B0_15   /*!< Pin name */
#define BOARD_INITCANPINS_CAN2_RX_LABEL                         "CAN2_RX/U12[4]"   /*!< Label */
#define BOARD_INITCANPINS_CAN2_RX_NAME                                 "CAN2_RX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< ENET signal: enet_mdc */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME                         GPIO_EMC_40   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL                             "ENET_MDC"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< ENET signal: enet_mdio */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME                        GPIO_EMC_41   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL                           "ENET_MDIO"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier name */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
#define BOARD_INITENETPINS_ENET_TX_CLK_PERIPHERAL                           ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TX_CLK_SIGNAL                       enet_ref_clk   /*!< ENET signal: enet_ref_clk */
#define BOARD_INITENETPINS_ENET_TX_CLK_PIN_NAME                       GPIO_B1_10   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TX_CLK_LABEL                       "ENET_TX_CLK"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_CLK_NAME                        "ENET_TX_CLK"   /*!< Identifier name */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL                                  0U   /*!< ENET enet_rx_data channel: 0 */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME                         GPIO_B1_04   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL                           "ENET_RXD0"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD0_NAME                            "ENET_RXD0"   /*!< Identifier name */

