Picovoice/porcupine/demo/mcu/imxrt1050/imxrt1050-evkb/board/pin_mux.h
/* GPIO_SD_B1_04 (coord P2), FlexSPI_CLK_B */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_PERIPHERAL                FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_SIGNAL             FLEXSPI_B_SCLK   /*!< FLEXSPI signal: FLEXSPI_B_SCLK */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_PIN_NAME            GPIO_SD_B1_04   /*!< Pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_LABEL             "FlexSPI_CLK_B"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_CLK_B_NAME              "FlexSPI_CLK_B"   /*!< Identifier name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_PERIPHERAL                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_SIGNAL              FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_PIN_NAME              GPIO_SD_B1_06   /*!< Pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_LABEL                 "FlexSPI_SS0"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_SS0_NAME                  "FlexSPI_SS0"   /*!< Identifier name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_PERIPHERAL                 FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_SIGNAL             FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_PIN_NAME             GPIO_SD_B1_11   /*!< Pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_LABEL               "FlexSPI_D3_A"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_D3_A_NAME                "FlexSPI_D3_A"   /*!< Identifier name */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_PERIPHERAL                  FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_SIGNAL                FLEXSPI_A_DQS   /*!< FLEXSPI signal: FLEXSPI_A_DQS */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_PIN_NAME              GPIO_SD_B1_05   /*!< Pin name */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_LABEL                 "FlexSPI_DQS"   /*!< Label */
#define BOARD_INITHYPERFLASHPINS_FlexSPI_DQS_NAME                  "FlexSPI_DQS"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitHyperFlashPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
